// 배열: 학생정보/전공정보(코드)/과목정보
const students = [{'이름': '황소연', '학번': '20220959','전공': '정보통신공학'}, { '이름': '권유린', '학번':20220518, '전공':'산업경영공학'}, {'이름': '서현욱', '학번':'20210846','전공':'미디어소프트웨어'},{'이름': '안현준', '학번':'20210852','전공':'컴퓨터공학'}]
const majors = [{'전공': '정보통신공학', '전공코드': '0'},{'전공': '산업경영공학', '전공코드': '1'},{'전공': '미디어소프프트웨어', '전공코드': '2'},{'전공':'컴퓨터공학', '전공코드':'3'}]
const classes = [{'강의': '머신러닝', '강의코드':'01', '학년':3, '학기':1},{'강의': '프로그래밍언어', '강의코드':'02', '학년':1, '학기':2},{'강의': '임베디드', '강의코드':'03', '학년':2, '학기':2},
    {'강의':'파이썬','강의코드':'11','학년':1,'학기':1},{'강의':'자바프로그래밍','강의코드':'12','학년':2,'학기':2},{'강의':'공학통계','강의코드':'13','학년':3,'학기':1},
    {'강의':'객체지향프로그래밍','강의코드':'21','학년':3,'학기':2},{'강의':'프로그래밍설계','강의코드':'22','학년':2,'학기':1},{'강의':'네트워크','강의코드':'23','학년':2,'학기':2},
    {'강의':'웹디자인','강의코드':'31','학년':1,'학기':1},{'강의':'파이썬프로그래밍','강의코드':'32','학년':2,'학기':1},{'강의':'게임프로그래밍','강의코드':'33','학년':3,'학기':2}
]
let 수강신청내역  = []

let who = prompt("관리자 or 학생을 입력해주세요")

if ( who == '관리자'){
    for(i=0; i < students.length ; i++){console.log(students[i].이름)}
}


if (who == '학생'){
    let who1 = prompt("학번을 입력해주세요")
    for( i = 0 ; i < students.length ; i++){
        if( who1 == students[i].학번){
            for(j=0 ; j < majors.length ; j++){
                if(students[j] == who1){
                    for( ; ;){
                    let 수강예정과목코드 = prompt("수강하고싶은 과목의 코드를 입력해주세요 그만 입력하려면 ** 를 입력하세요 ")

                    if(수강예정과목코드 == '**'){break}

                    if(indexof == 수강예정과목코드){continue}

                    수강신청내역(push(수강예정과목코드))
                    console.log (students[j]+"님의 수강신청 내역입니다.")
                }
                }
                
                console.log(수강신청내역)
            }
            
        }
        else { 
            console.log("등록되지않은 학번입니다")
             break
            }
        
    }
}

